/*姓名：张永雄 学号2017210415 序号15 班级01141709*/
#include"../include/main.h"
void zengjia(pp txl[])
{
    system("cls");
    char c;
    printf("\n\t\t____________________|请输入联系人信息|_______________________\n");
    printf("\n\t\t 输入联系人姓名:");
    scanf("%s",txl[n].xingming);
    printf("\n\t\t_____________________________________________________________\n");
    printf("\n\t\t 输入联系人电话号码:");
    scanf("%s",txl[n].dianhua);
    printf("\n\t\t_____________________________________________________________\n");
    printf("\n\t\t 输入联系人地址:");
    scanf("%s",txl[n].dizhi);
    printf("\n\t\t_____________________________________________________________\n");
    printf("\n\t\t 输入联系人公司:");
    scanf("%s",txl[n].com);
    printf("\n\t\t_____________________________________________________________\n");
    n++;
    getchar();
    printf("\n\t\t 是否继续添加联系人?按1继续，按其他键返回主菜单！:");
    c=getch();
    if(c=='1')
    {
        zengjia(txl);
    }
    else
    {
        return;
    }
}
/*姓名：张永雄 学号2017210415 序号15 班级01141709*/
